var changelog = [
	["2022-01-15", [
		"增加了搜索引擎记忆 每次加载页面将自动选择上一次使用的搜索引擎",
		"调整配色"
	]],
	["2022-01-13", [
		"添加了「一言」(hitokoto)",
		"增加搜索引擎「searX」"
	]],
	["2021-12-05", [
		"优化背景图片黑影和加载动画",
		"背景图片现在会自动在 1080p 和 4k 间调整",
		"改进搜索框样式"
	]],
	["2021-11-15", [
		"输入框进入输入时会出现「弹跳」动画",
		"调整输入框的透明度",
		"Fix: 页面上的「时间」和「日期」使得页面加载动画卡顿的问题"
	]],
	["2021-11-14", [
		"重写「按钮」和「输入框」的样式",
		"微调页面字体",
		"调整圆角大小",
		"去除不必要的视觉干扰",
		"左上角「天气」中加入「空气质量」",
		"添加右键菜单"
	]],
	["2021-11-13", [
		"修改主题色",
		"Fix: 「毛玻璃」造成的卡顿",
		"合并多个 JavaScript，增加访问速度",
		"重写「大事记」以及其它页面部分"
	]],
	["2021-11-12", [
		"优化访问速度",
		"重新添加「毛玻璃」效果"
	]],
	["2021-11-10", [
		"增加「兼容性问题说明」"
	]],
	["2021-10-23", [
		"添加「右键菜单」(暂无内容)",
		"改动「天气」界面样式"
	]],
	["2021-10-17", [
		"为自定义链接做准备",
		"使用了 jQuery"
	]],
	["2021-10-11", [
		"Fix: 时间无法自动更新的问题",
		"尝试优化「天气」的字体"
	]],
	["2021-10-10", [
		"合并部分 JavaScript",
		"「时间」和「日期」分开显示在两行"
	]],
	["2021-10-08", [
		"「便笺」加入 Markdown 语法支持",
		"现在「Markdown 预览」会在输入框失去焦点后自动替换在输入框的位置"
	]],
	["2021-10-07", [
		"设计大改动",
		"添加「便笺」功能",
		"将 5 个搜索框合并，改用下拉列表",
		"文字更通顺了",
		"修改滚动条样式 (仅 Chromium 内核浏览器可用)"
	]],
	["2021-10-05", [
		"删除「Font Awesome」字体"
	]],
	["2021-10-03", [
		"修改字体为「Open Sans」"
	]],
	["2021-10-02", [
		"创建「NewTAB 2.0」",
		"将原有页面迁移至 `/1.0` 目录下"
	]],
	["2021-03-13 ~ 2021-06-15", [
		"不断寻找更好的谷歌镜像",
		"完善相关说明"
	]],
	["2021-01-27", [
		"找到了一个稳定的 Google 镜像",
		"正式加入「搜索谷歌镜像」和「问谷歌」的输入框"
	]],
	["2021-01-10", [
		"删除多语言",
		"调整界面设计",
		"增加 404 页面"
	]],
	["2020-12-04", [
		"增加「繁体中文」和「English」页面"
	]],
	["2020-12-03", [
		"添加至 5 个搜索引擎",
		"调整页脚"
	]],
	["2020-12-02", [
		"为多语言做准备"
	]],
	["2020-11-15", [
		"调整布局，让按钮分布更均匀"
	]],
	["2020-11-08", [
		"修改了输入框的样式"
	]],
	["2020-11-07", [
		"添加「百度」和「Bing」搜索框",
		"添加「毛玻璃」效果"
	]],
	["2020-10-24", [
		"左侧栏加入「时间」",
		"为搜索框增加预留空间"
	]],
	["2020-10-22", [
		"「NewTAB」上线!"
		]
	]
];

var changelogStr = "";
var length = changelog.length, itemlength;

for (var i = 0; i < length; i ++) {
	itemlength = changelog[i][1].length;
	changelogStr += changelog[i][0] + "\n\n";
	for (var j = 0; j < itemlength; j ++) {
		changelogStr += "- " + changelog[i][1][j] + "\n";
	}
	changelogStr += "\n";
}

changelogStr = changelogStr.replaceAll("「", "「**");
changelogStr = changelogStr.replaceAll("」", "**」");
$("#changeLog").html(marked.parse(changelogStr));